Reports/СостояниеИзделий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СостояниеИзделий</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ОбещанияВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбещанияВыполнения</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОбещания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбещаниеВыполнения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбещанияВыполения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзделиеКомплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОбещаниеПодрядчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбещаниеПодрядчика</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОбещания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозвратНаСклад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзделиеКомплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/КомплектыУПодрядчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>КомплектыУПодрядчика</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзделиеКомплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ДанныеИзделияЗаказчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеИзделияЗаказчика</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеСАртикулом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИзделиеЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияЗаказчика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДатыКомплектаПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыКомплектаПроизводство</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайСтолярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайМалярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайПодрядчик</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоСтолярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоМалярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоПодрядчик</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремениПроизводства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДатыКомплектаМонтаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыКомплектаМонтаж</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КрайМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремениМонтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСотрудниковМонтаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлановаяГотовностьПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПлановаяГотовностьПомещений</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаГотовности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ИзделияЗаказчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИзделияЗаказчика</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПомещенияСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПоТЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВДоговоре</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияЭлемент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеЭлемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Помещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/СостояниеИзделий/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Обновить(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьТаблицуЦветов();
	СформироватьОтчетНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуЦветов()

	
    НС = тзЦветаНаправления.Добавить();
	НС.Направление = "ТекущиеНаправление";
	НС.Цвет = Новый Цвет(201, 252, 255);
	
    НС = тзЦветаНаправления.Добавить();
	НС.Направление = "ЦветОшибкиФон";
	НС.Цвет = Новый Цвет(255, 150, 153);
	
    НС = тзЦветаНаправления.Добавить();
	НС.Направление = "ЦветОшибкиТекст";
	НС.Цвет = Новый Цвет(255, 10, 13);
	

КонецПроцедуры // ЗаполнитьТаблицуЦветов()    

&НаСервере
Процедура СформироватьОтчетНаСервере()
	мСделки = ПолучитьСделки();
	стТаблицы = ПолучитьТаблицуДанных(мСделки);

	ВывестиДанные(стТаблицы);
КонецПроцедуры // СформироватьОтчетНаСервере()

&НаСервере
Процедура ВывестиДанные(стТаблицы)

	стОтбор = Новый Структура("ИзделиеКомплект", );
	
	ПустаяДата = Дата(1,1,1);
	
	Таб = ЭтаФорма.ПолеВывода;
	Таб.Очистить();
	
	Макет = Отчеты.СостояниеИзделий.ПолучитьМакет("Макет");
	
	Таб.Вывести(Макет.ПолучитьОбласть("Шапка"));
	Таб.ФиксацияСверху = Таб.ВысотаТаблицы;
	Таб.ФиксацияСлева  = 4;
	
	обСтрока 	= Макет.ПолучитьОбласть("Строка"); 
	
	БелыйЦвет 	= Новый Цвет(255, 255, 255);
	ЧерныйЦвет 	= Новый Цвет(0, 0, 0);
	
	ЦветОшибкиФон 	= НазначитьЦветФона("ЦветОшибкиФон", 		БелыйЦвет);
	ЦветОшибкиТекст	= НазначитьЦветФона("ЦветОшибкиТекст", 		БелыйЦвет);
	ЦветТекущий 	= НазначитьЦветФона("ТекущиеНаправление", 	БелыйЦвет);
	ТД = НачалоДня(ТекущаяДата());
	ПустаДата = Дата(1, 1, 1);
	
	стЦвета = Новый Структура("ЦветОшибкиФон, БелыйЦвет, ЦветТекущий, ЧерныйЦвет, ЦветОшибкиТекст", 
							   ЦветОшибкиФон, БелыйЦвет, ЦветТекущий, ЧерныйЦвет, ЦветОшибкиТекст);
	стДаты = Новый Структура("ПустаДата, ТД", ПустаДата, ТД);
	
	тзДатыОбещания 		= стТаблицы.тзДатыОбещания;
	
	Для каждого ИзделиеЗаказчика Из стТаблицы.сзИзделияЗаказчика Цикл
		
		мСтрокиДанных = Новый Массив;
		
		Для каждого текСтрока Из стТаблицы.тзДанные Цикл
			Для каждого текИзделиеЗаказчика Из текСтрока.ИзделиеЗаказчика Цикл
				Если текИзделиеЗаказчика = ИзделиеЗаказчика.Значение Тогда
					мСтрокиДанных.Добавить(текСтрока);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Если мСтрокиДанных.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		обСтрока.Параметры.ИзделиеЗаказчикаЭлемент 		= ИзделиеЗаказчика.Значение; 
		обСтрока.Параметры.НаименованиеИзделияЗаказчика = ИзделиеЗаказчика.Представление;
		
		
		Для каждого текСтрока Из мСтрокиДанных Цикл
			
			обСтрока.Параметры.Заполнить(текСтрока); 

			ДатаПринятия 				= текСтрока.ДатаПринятия;
			
			НайденаяСтрока = тзДатыОбещания.Найти(текСтрока.ИзделиеКомплект, "ИзделиеКомплект");
			Если НайденаяСтрока = Неопределено Тогда
				обСтрока.Параметры.ДатаОбещания = "";
			Иначе
				обСтрока.Параметры.ДатаОбещания = НайденаяСтрока.ДатаОбещания;
			КонецЕсли;
			
			стОтбор.ИзделиеКомплект = текСтрока.ИзделиеКомплект;
			
			ЦветовоеОформление(обСтрока, текСтрока, стДаты, стЦвета); 
			

			Таб.Вывести(обСтрока);
			
		КонецЦикла; 
		
	КонецЦикла;

	Таб.Вывести(Макет.ПолучитьОбласть("ПоследняяСтрока"));
КонецПроцедуры // ВывестиДанные()  

Процедура ЦветовоеОформление(обСтрока, текСтрока, стДаты, стЦвета)
	
	обСтрока.Области.ТЗ.ЦветФона 			= стЦвета.БелыйЦвет;
	обСтрока.Области.ПКД.ЦветФона 			= стЦвета.БелыйЦвет;
	обСтрока.Области.РКД.ЦветФона 			= стЦвета.БелыйЦвет;
	обСтрока.Области.Производство.ЦветФона 	= стЦвета.БелыйЦвет;
	обСтрока.Области.Монтаж.ЦветФона 		= стЦвета.БелыйЦвет;
	
	
	Если текСтрока.Направление = Справочники.СтадииКомплекта.ТЗ Тогда
		
		Если стДаты.ТД > текСтрока.КрайТЗ И текСтрока.КрайТЗ > стДаты.ПустаДата Тогда
			обСтрока.Области.ТЗ.ЦветФона = стЦвета.ЦветОшибкиФон;
		Иначе
			обСтрока.Области.ТЗ.ЦветФона = стЦвета.ЦветТекущий;
		КонецЕсли;
		
	ИначеЕсли текСтрока.Направление = Справочники.СтадииКомплекта.ПКД Тогда
		
		Если стДаты.ТД > текСтрока.КрайПКД И текСтрока.КрайПКД > стДаты.ПустаДата Тогда
			обСтрока.Области.ПКД.ЦветФона = стЦвета.ЦветОшибкиФон;
		Иначе
			обСтрока.Области.ПКД.ЦветФона = стЦвета.ЦветТекущий;
		КонецЕсли;
		
	ИначеЕсли текСтрока.Направление = Справочники.СтадииКомплекта.РКД Тогда
		
		Если стДаты.ТД > текСтрока.КрайРКД И текСтрока.КрайРКД > стДаты.ПустаДата Тогда
			обСтрока.Области.РКД.ЦветФона = стЦвета.ЦветОшибкиФон;
		Иначе
			обСтрока.Области.РКД.ЦветФона = стЦвета.ЦветТекущий;
		КонецЕсли;
		
	ИначеЕсли текСтрока.Направление = Справочники.СтадииКомплекта.Производство Тогда
		
		Если стДаты.ТД > текСтрока.КрайПроизводства И текСтрока.КрайПроизводства > стДаты.ПустаДата Тогда
			обСтрока.Области.Производство.ЦветФона = стЦвета.ЦветОшибкиФон;
		Иначе
			обСтрока.Области.Производство.ЦветФона = стЦвета.ЦветТекущий;
		КонецЕсли;
		
	ИначеЕсли текСтрока.Направление = Справочники.СтадииКомплекта.Монтаж Тогда
		
		Если стДаты.ТД > текСтрока.КрайМонтажа И текСтрока.КрайМонтажа > стДаты.ПустаДата Тогда
			обСтрока.Области.Монтаж.ЦветФона = стЦвета.ЦветОшибкиФон;
		Иначе
			обСтрока.Области.Монтаж.ЦветФона = стЦвета.ЦветТекущий;
		КонецЕсли;
		
	КонецЕсли; 
	
	Если стДаты.ТД > текСтрока.ПсиДата И текСтрока.ПсиДата > стДаты.ПустаДата Тогда
		обСтрока.Области.ПсиДата.ЦветФона = стЦвета.ЦветОшибкиФон;
	Иначе
		обСтрока.Области.ПсиДата.ЦветФона = стЦвета.БелыйЦвет;
	КонецЕсли;
	
	Если стДаты.ТД > текСтрока.ДогДата И текСтрока.ПсиДата > текСтрока.ДогДата Тогда
		обСтрока.Области.ДогДата.ЦветФона = стЦвета.ЦветОшибкиФон;
	Иначе
		обСтрока.Области.ДогДата.ЦветФона = стЦвета.БелыйЦвет;
	КонецЕсли;
	
	Если СтрНайти(текСтрока.ОстатокПКД, "Ост") = 0 И НЕ текСтрока.Направление = Справочники.НаправленияБитрикс.ПКД Тогда
		обСтрока.Области.ОстатокПКД.ЦветТекста = стЦвета.ЦветОшибкиТекст;
	Иначе
		обСтрока.Области.ОстатокПКД.ЦветТекста = стЦвета.ЧерныйЦвет;
	КонецЕсли;
		
	Если СтрНайти(текСтрока.ОстатокРКД, "Ост") = 0 И НЕ текСтрока.Направление = Справочники.НаправленияБитрикс.РКД Тогда
		обСтрока.Области.ОстатокРКД.ЦветТекста = стЦвета.ЦветОшибкиТекст;
	Иначе
		обСтрока.Области.ОстатокРКД.ЦветТекста = стЦвета.ЧерныйЦвет;
	КонецЕсли;
		
	Если СтрНайти(текСтрока.ОстатокПроизводства, "Ост") = 0 И НЕ текСтрока.Направление = Справочники.НаправленияБитрикс.Производство Тогда
		обСтрока.Области.ОстатокПроизводства.ЦветТекста = стЦвета.ЦветОшибкиТекст;
	Иначе
		обСтрока.Области.ОстатокПроизводства.ЦветТекста = стЦвета.ЧерныйЦвет;
	КонецЕсли;
		
	Если СтрНайти(текСтрока.ОстатокМонтажа, "Ост") = 0 И НЕ текСтрока.Направление = Справочники.НаправленияБитрикс.Монтаж Тогда
		обСтрока.Области.ОстатокМонтажа.ЦветТекста = стЦвета.ЦветОшибкиТекст;
	Иначе
		обСтрока.Области.ОстатокМонтажа.ЦветТекста = стЦвета.ЧерныйЦвет;
	КонецЕсли;
		
	Если СтрНайти(текСтрока.ЗапасТЗ, "Ост") = 0 И НЕ текСтрока.Направление = Справочники.НаправленияБитрикс.ТЗ Тогда
		обСтрока.Области.ЗапасТЗ.ЦветТекста = стЦвета.ЦветОшибкиТекст;
	Иначе
		обСтрока.Области.ЗапасТЗ.ЦветТекста = стЦвета.ЧерныйЦвет;
	КонецЕсли; 
	
	Если текСтрока.СтатусПодрядчика = 1 Тогда
		обСтрока.Области.Подряд.ЦветФона = стЦвета.ЦветОшибкиФон;
	Иначе
		обСтрока.Области.Подряд.ЦветФона = стЦвета.БелыйЦвет;
	КонецЕсли;
		
КонецПроцедуры

Функция НазначитьЦветФона(Направление, АльтернативныйЦвет)
	
	Для каждого х Из тзЦветаНаправления Цикл
		Если х.Направление = Направление Тогда
			Возврат х.Цвет;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат АльтернативныйЦвет;
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеПроизводственногоКоплекта(обСтрока,НомерИндекса,ИмяПараметра, СтрокаДанных)
	
	Если СтрокаДанных = Неопределено Тогда
		обСтрока.Параметры[ИмяПараметра + НомерИндекса] = СтрокаДанных;
	Иначе
		обСтрока.Параметры[ИмяПараметра + НомерИндекса] = СтрокаДанных[ИмяПараметра];
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьДанныеПроизводственногоКоплекта()

&НаСервере
Функция ПолучитьТаблицуДанных(мСделки)
	
	тзДанные 					= ЗаполнитьКомплектыИзделий(мСделки);
	Комплекты 					= омТЧ_НаКлиентеСервере.КолонкуВМассив(тзДанные,"ИзделиеКомплект");
	
	тзДатыОбещания = Новый ТаблицаЗначений;
	тзДатыОбещания.Колонки.Добавить("ИзделиеКомплект", 	Новый ОписаниеТипов("СправочникСсылка.ИзделияКомплект"));
	тзДатыОбещания.Колонки.Добавить("ДатаОбещания", 	Новый ОписаниеТипов("Дата"));
	тзДатыОбещания.Индексы.Добавить("ИзделиеКомплект");
	
	Для каждого х Из Комплекты Цикл
		
		НС = тзДатыОбещания.Добавить();
		НС.ИзделиеКомплект = х;
		
	КонецЦикла;
	
	сзИзделияЗаказчика = Новый СписокЗначений;
	
	РасчитатьПоля(тзДанные,  Комплекты, сзИзделияЗаказчика, тзДатыОбещания);
	
	РасчитатьДатуОбещания(тзДатыОбещания, Комплекты);
	
	Возврат Новый Структура("тзДанные, сзИзделияЗаказчика, тзДатыОбещания",тзДанные, сзИзделияЗаказчика, тзДатыОбещания);
КонецФункции // ПолучитьТаблицуДанных()

Процедура РасчитатьДатуОбещания(тзДатыОбещания, Комплекты)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбещанияВыполненияСрезПоследних.ДатаОбещания КАК ДатаОбещания,
		|	ОбещанияВыполненияСрезПоследних.ИзделиеКомплект КАК ИзделиеКомплект
		|ИЗ
		|	РегистрСведений.ОбещанияВыполнения.СрезПоследних(, ИзделиеКомплект В (&Комплекты)) КАК ОбещанияВыполненияСрезПоследних";
	
	Запрос.УстановитьПараметр("Комплекты", Комплекты);
	Запрос.УстановитьПараметр("Проект", Сделка);
	
	Выборка = Запрос.Выполнить().Выбрать();

	стОтбор = Новый Структура("ИзделиеКомплект", );
	
	Пока Выборка.Следующий() Цикл
		                
		стОтбор.ИзделиеКомплект = Выборка.ИзделиеКомплект;
		
		Для каждого х Из тзДатыОбещания.НайтиСтроки(стОтбор) Цикл
			х.ДатаОбещания = Выборка.ДатаОбещания;	
		КонецЦикла;
		
	КонецЦикла;
	

КонецПроцедуры // РасчитатьДатуОбещания(тзДатыОбещания)()

Процедура РасчитатьПоля(тзДанные,  Комплекты, сзИзделияЗаказчика, тзДатыОбещания)
	
	СекундВСутках = 24 * 3600;
	
	ПустаяДата 	= Дата(1,1,1);
	ТД			= НачалоДня(ТекущаяДата());
	
	типСтрока 	= Новый ОписаниеТипов("Строка");
	типЧисло 	= Новый ОписаниеТипов("Число");
	
	тзДанные.Колонки.Добавить("ЗапасТЗ",					типСтрока);
	тзДанные.Колонки.Добавить("ЗапасПКД",					типЧисло);
	тзДанные.Колонки.Добавить("ЗапасРКД",					типЧисло);
	тзДанные.Колонки.Добавить("ОстатокПКД",					типСтрока);
	тзДанные.Колонки.Добавить("ОстатокПсиДата",				типСтрока);
	тзДанные.Колонки.Добавить("ПланПКДСтрокой",				типСтрока);
	тзДанные.Колонки.Добавить("ОстатокРКД",					типСтрока);
	тзДанные.Колонки.Добавить("ПланРКДСтрокой",				типСтрока);
	тзДанные.Колонки.Добавить("ПланПроизводстваСтрокой",	типСтрока);
	тзДанные.Колонки.Добавить("ПланМонтажаСтрокой",			типСтрока);
	тзДанные.Колонки.Добавить("ОстатокПроизводства",		типСтрока);
	тзДанные.Колонки.Добавить("ОстатокМонтажа",				типСтрока);
	тзДанные.Колонки.Добавить("ДатаПодряда",				типСтрока);
	тзДанные.Колонки.Добавить("ИзделиеЗаказчика",			Новый ОписаниеТипов("Массив")); 
	тзДанные.Колонки.Добавить("СтатусПодрядчика",			Новый ОписаниеТипов("Число")); //0 во время ,1 опаздание
	тзДанные.Колонки.Добавить("Подрядчик",					Новый ОписаниеТипов("СправочникСсылка.Контрагенты")); 
	
	тзКомплектИзделие = ПолучитьИзделияИзКомплектов(Комплекты);       
	тзКомплектИзделие.Индексы.Добавить("ИзделиеКомплект");
	
	тзПодряд = ПолучитьДанныеПодряда(Комплекты);       
	
	ТД 			= НачалоДня(ТекущаяДата());
	ТД_желтый 	= ТД - 3600 * 48;
	
	Для каждого х Из тзКомплектИзделие Цикл
		Если сзИзделияЗаказчика.НайтиПоЗначению(х.ИзделиеКомплект) = Неопределено Тогда
			сзИзделияЗаказчика.Добавить(х.ИзделиеЗаказчика, х.НаименованиеИзделияЗаказчика);
		КонецЕсли;
	КонецЦикла;
	
	стОтбор = Новый Структура("ИзделиеКомплект", ); 
	
	Для каждого х Из тзДанные Цикл
		
		Если ЗначениеЗаполнено(х.ПсиДата) Тогда
			х.ОстатокПсиДата = ПолучитьТекстОстатка(х.ПсиДата, ТД, СекундВСутках);
		КонецЕсли;
		
		УжеНаУровне = Ложь;
		
		х.ПланМонтажаСтрокой 	= Формат(х.КрайМонтажа,"ДФ=dd.MM.yy");
		х.ОстатокМонтажа 		= "";
		//Если х.Направление = Справочники.НаправленияБитрикс.Монтаж Тогда
		//	УжеНаУровне = Истина;
		//КонецЕсли;
		//
		Если ЗначениеЗаполнено(х.КрайМонтажа) Тогда
			х.ОстатокМонтажа = ПолучитьТекстОстатка(х.КрайМонтажа, ТД, СекундВСутках);
		КонецЕсли;
		
		НайденаСтрокаПодряд = тзПодряд.Найти(х.ИзделиеКомплект, "ИзделиеКомплект");
		
		х.ОстатокПроизводства 		= "";
		Если НайденаСтрокаПодряд = Неопределено Тогда
			х.ПланПроизводстваСтрокой 	= Формат(х.КрайПроизводства,"ДФ=dd.MM.yy");
		Иначе
			х.Подрядчик 		= НайденаСтрокаПодряд.Подрядчик;
			х.ДатаПодряда 		= НайденаСтрокаПодряд.ДатаПодряда;
			х.СтатусПодрядчика 	= НайденаСтрокаПодряд.СтатусПодрядчика;
		КонецЕсли;
		
		Если НЕ УжеНаУровне И НайденаСтрокаПодряд = Неопределено Тогда 
			
			Если ЗначениеЗаполнено(х.КрайПроизводства) Тогда
				х.ОстатокПроизводства = ПолучитьТекстОстатка(х.КрайПроизводства, ТД, СекундВСутках);
			КонецЕсли;
			
		КонецЕсли;
		
		//Если х.Направление = Справочники.НаправленияБитрикс.Производство И НЕ УжеНаУровне Тогда
		//	УжеНаУровне = Истина;
		//КонецЕсли;
		//
		//Если х.Направление = Справочники.НаправленияБитрикс.РКД Тогда
		//	х.ПланРКДСтрокой = Формат(х.ПланРКД,"ДФ=dd.MM.yy") + "-" + Формат(х.КрайРКД,"ДФ=dd.MM.yy");	
		//Иначе
		//	х.ПланРКДСтрокой 	= Формат(х.КрайРКД,"ДФ=dd.MM.yy");	
		//КонецЕсли;
		
		х.ОстатокРКД 	 = "";
		Если НЕ УжеНаУровне Тогда 
			
			Если ЗначениеЗаполнено(х.КрайРКД) Тогда
				х.ОстатокРКД = ПолучитьТекстОстатка(х.КрайРКД, ТД, СекундВСутках);
			КонецЕсли;
			
		КонецЕсли;
		
		Если х.Направление = Справочники.НаправленияБитрикс.РКД И НЕ УжеНаУровне Тогда
			УжеНаУровне = Истина;
		КонецЕсли;
		//
		//Если х.Направление = Справочники.НаправленияБитрикс.ПКД Тогда
		//	х.ПланПКДСтрокой 	= Формат(х.ПланПКД,"ДФ=dd.MM.yy") + "-" + Формат(х.КрайПКД,"ДФ=dd.MM.yy");	
		//Иначе
		//	х.ПланПКДСтрокой 	= Формат(х.КрайПКД,"ДФ=dd.MM.yy");	
		//КонецЕсли;
		//
		х.ОстатокПКД 	= "";
		Если НЕ УжеНаУровне Тогда 
			
			Если ЗначениеЗаполнено(х.КрайПКД) Тогда
				х.ОстатокПКД = ПолучитьТекстОстатка(х.КрайПКД, ТД, СекундВСутках);
			КонецЕсли;
			
		КонецЕсли; 
		
		Если х.Направление = Справочники.НаправленияБитрикс.ПКД И НЕ УжеНаУровне Тогда
			УжеНаУровне = Истина;
		КонецЕсли;
		
		х.ЗапасТЗ 	= "";
		Если НЕ УжеНаУровне Тогда
			
			Если ЗначениеЗаполнено(х.КрайТЗ) Тогда
				х.ЗапасТЗ = ПолучитьТекстОстатка(х.КрайТЗ, ТД, СекундВСутках);
			КонецЕсли;
			
		КонецЕсли;
		
		стОтбор.ИзделиеКомплект = х.ИзделиеКомплект;
		НайденыеСтроки = тзКомплектИзделие.НайтиСтроки(стОтбор);
		
		Для каждого текКомплект Из НайденыеСтроки Цикл
			х.ИзделиеЗаказчика.Добавить(текКомплект.ИзделиеЗаказчика);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры //РасчитатьПоля(тзДанные) 


Функция ПолучитьДанныеПодряда(Комплекты)

    тзПодряд = Новый ТаблицаЗначений;
	тзПодряд.Колонки.Добавить("ИзделиеКомплект", 	Новый ОписаниеТипов("СправочникСсылка.ИзделияКомплект"));
	тзПодряд.Колонки.Добавить("Подрядчик", 			Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	тзПодряд.Колонки.Добавить("ДатаОбещания", 		Новый ОписаниеТипов("Дата"));
	тзПодряд.Колонки.Добавить("ДатаПодряда", 		Новый ОписаниеТипов("Строка"));
	тзПодряд.Колонки.Добавить("СтатусПодрядчика",	Новый ОписаниеТипов("Число"));
	тзПодряд.Индексы.Добавить("ИзделиеКомплект");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбещаниеПодрядчикаСрезПоследних.ИзделиеКомплект КАК ИзделиеКомплект,
		|	ОбещаниеПодрядчикаСрезПоследних.ДатаОбещания КАК ДатаОбещания,
		|	ОбещаниеПодрядчикаСрезПоследних.Подрядчик КАК Подрядчик
		|ИЗ
		|	РегистрСведений.ОбещаниеПодрядчика.СрезПоследних(, ИзделиеКомплект В (&ИзделиеКомплект)) КАК ОбещаниеПодрядчикаСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КомплектыУПодрядчика.ИзделиеКомплект КАК ИзделиеКомплект,
		|	МАКСИМУМ(КомплектыУПодрядчика.Период) КАК Период,
		|	КомплектыУПодрядчика.Подрядчик КАК Подрядчик
		|ИЗ
		|	РегистрНакопления.КомплектыУПодрядчика КАК КомплектыУПодрядчика
		|ГДЕ
		|	КомплектыУПодрядчика.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И КомплектыУПодрядчика.ИзделиеКомплект В(&ИзделиеКомплект)
		|
		|СГРУППИРОВАТЬ ПО
		|	КомплектыУПодрядчика.Подрядчик,
		|	КомплектыУПодрядчика.ИзделиеКомплект";
	
	Запрос.УстановитьПараметр("ИзделиеКомплект", Комплекты);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	ТД = ТекущаяДата();
		
	Пока Выборка.Следующий() Цикл
		НС = тзПодряд.Добавить();
		НС.ИзделиеКомплект 	= Выборка.ИзделиеКомплект;
		НС.Подрядчик 		= Выборка.Подрядчик;
		НС.ДатаПодряда 		= Формат(Выборка.ДатаОбещания, "ДФ=dd.MM.yy") + "-";
		НС.ДатаОбещания		= Выборка.ДатаОбещания;
		
		Если ТД > НС.ДатаОбещания Тогда
			НС.СтатусПодрядчика = 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Выборка = РезультатЗапроса[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл

		
		НайденаяСтрока = тзПодряд.Найти(Выборка.ИзделиеКомплект, "ИзделиеКомплект");
		
		Если НайденаяСтрока = Неопределено Тогда
			НС = тзПодряд.Добавить();
			НС.ИзделиеКомплект 	= Выборка.ИзделиеКомплект;
			НС.Подрядчик 		= Выборка.Подрядчик;
			НС.ДатаПодряда	 	= "-" + Формат(Выборка.Период, "ДФ=dd.MM.yy");
			
		Иначе
			НайденаяСтрока.ДатаПодряда = НайденаяСтрока.ДатаПодряда + Формат(Выборка.Период, "ДФ=dd.MM.yy");
			
			Если Выборка.Период > НайденаяСтрока.ДатаОбещания Тогда
				НС.СтатусПодрядчика = 1;
			Иначе
				НС.СтатусПодрядчика = 0;
			КонецЕсли;
		КонецЕсли;                                      
		
	КонецЦикла;
	
	Возврат тзПодряд;
	
КонецФункции // ПолучитьДанныеПодряда(Комплекты)


Функция ПолучитьТекстОстатка(КрайняяДата, ТД, СекундВСутках)
	
	Остаток = (КрайняяДата - ТД) / СекундВСутках;
	
	Если Остаток = 0 Тогда
		Возврат "Крайний день";
	КонецЕсли;
	
	Возврат ?(Остаток > 0, "Осталось ", "Опоздание ") + ?(Остаток > 0, Остаток, -Остаток);
	
КонецФункции

Функция ПолучитьИзделияИзКомплектов(Комплекты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплектИзделияЭлемент.Ссылка КАК ИзделиеКомплект,
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка КАК ИзделиеЗаказчика,
		|	ЕСТЬNULL(ДанныеИзделияЗаказчика.Артикул, """") + "" "" + ИзделияЗаказчикаИзделияЭлемент.Ссылка.Наименование КАК НаименованиеИзделияЗаказчика
		|ИЗ
		|	Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеИзделияЗаказчика КАК ДанныеИзделияЗаказчика
		|			ПО (ДанныеИзделияЗаказчика.ИзделиеЗаказчика = ИзделияЗаказчикаИзделияЭлемент.Ссылка)
		|		ПО ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент = ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент
		|ГДЕ
		|	ИзделияКомплектИзделияЭлемент.Ссылка В(&Комплекты)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(ДанныеИзделияЗаказчика.Артикул, """") + "" "" + ИзделияЗаказчикаИзделияЭлемент.Ссылка.Наименование,
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка,
		|	ИзделияКомплектИзделияЭлемент.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаименованиеИзделияЗаказчика";
	
	Запрос.УстановитьПараметр("Комплекты", Комплекты);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьИзделияИзКомплектов()

Функция ЗаполнитьПроизводственныеКомплекты(Комплекты)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводственныеКомплекты.Ссылка КАК ПроизводственныйКомплект,
		|	ПроизводственныеКомплекты.ИзделиеКомплект КАК ИзделиеКомплект,
		|	ДатыКомплектаПроизводство.КрайСтолярка КАК КрайСтолярка,
		|	ДатыКомплектаПроизводство.КрайМалярка КАК КрайМалярка,
		|	ДатыКомплектаПроизводство.КрайПодрядчик КАК КрайПодрядчик,
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка КАК ИзделиеЗаказчика,
		|	ЕСТЬNULL(ПринятыеПомещения.ДатаДоговорнойГотовности, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПринятиеПомещения
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Справочник.ПроизводственныеКомплекты КАК ПроизводственныеКомплекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплектаПроизводство КАК ДатыКомплектаПроизводство
		|		ПО (ДатыКомплектаПроизводство.Комплект = ПроизводственныеКомплекты.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПроизводственныеКомплекты.ИзделияЭлемент КАК ПроизводственныеКомплектыИзделияЭлемент
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
		|			ПО (ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент = ПроизводственныеКомплектыИзделияЭлемент.ИзделиеЭлемент)
		|		ПО (ПроизводственныеКомплектыИзделияЭлемент.Ссылка = ПроизводственныеКомплекты.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПринятыеПомещения КАК ПринятыеПомещения
		|		ПО ПроизводственныеКомплекты.ИзделиеКомплект.ОсновноеПомещение = ПринятыеПомещения.Помещение
		|ГДЕ
		|	ПроизводственныеКомплекты.ИзделиеКомплект В(&ИзделиеКомплект)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДатыКомплектаМонтаж.КрайМонтажа КАК Монтаж,
		|	вт.ПроизводственныйКомплект КАК ПроизводственныйКомплект,
		|	вт.КрайСтолярка КАК Столярка,
		|	вт.КрайМалярка КАК Малярка,
		|	вт.ИзделиеКомплект КАК ИзделиеКомплект,
		|	вт.КрайПодрядчик КАК Подряд,
		|	ВЫБОР
		|		КОГДА ПриложенияКДоговорамИзделияЗаказчика.Ссылка.ДатаДоговора > вт.ДатаПринятиеПомещения
		|			ТОГДА ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ПриложенияКДоговорамИзделияЗаказчика.Ссылка.ДатаДоговора, НЕДЕЛЯ, ПриложенияКДоговорамИзделияЗаказчика.Ссылка.ВнутреннийЗапасВНеделях), НЕДЕЛЯ, ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокМонтажаВНеделях), НЕДЕЛЯ, ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокПроизводстваВНеделях)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(вт.ДатаПринятиеПомещения, НЕДЕЛЯ, ПриложенияКДоговорамИзделияЗаказчика.Ссылка.ВнутреннийЗапасВНеделях), НЕДЕЛЯ, ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокМонтажаВНеделях), НЕДЕЛЯ, ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокПроизводстваВНеделях)
		|	КОНЕЦ КАК ПсиДата,
		|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка.ДатаДоговора КАК ДогДата
		|ИЗ
		|	Справочник.ПриложенияКДоговорам.ИзделияЗаказчика КАК ПриложенияКДоговорамИзделияЗаказчика
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МонтажныеКомплекты.ПроизводственныеКомплекты КАК МонтажныеКомплектыПроизводственныеКомплекты
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплектаМонтаж КАК ДатыКомплектаМонтаж
		|				ПО МонтажныеКомплектыПроизводственныеКомплекты.Ссылка = ДатыКомплектаМонтаж.Комплект
		|			ПО вт.ПроизводственныйКомплект = МонтажныеКомплектыПроизводственныеКомплекты.ПроизводственныйКомплект
		|		ПО ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика = вт.ИзделиеЗаказчика
		|
		|СГРУППИРОВАТЬ ПО
		|	вт.КрайСтолярка,
		|	вт.ПроизводственныйКомплект,
		|	вт.ДатаПринятиеПомещения,
		|	вт.ИзделиеКомплект,
		|	вт.КрайМалярка,
		|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка.ДатаДоговора,
		|	вт.КрайПодрядчик,
		|	ВЫБОР
		|		КОГДА ПриложенияКДоговорамИзделияЗаказчика.Ссылка.ДатаДоговора > вт.ДатаПринятиеПомещения
		|			ТОГДА ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ПриложенияКДоговорамИзделияЗаказчика.Ссылка.ДатаДоговора, НЕДЕЛЯ, ПриложенияКДоговорамИзделияЗаказчика.Ссылка.ВнутреннийЗапасВНеделях), НЕДЕЛЯ, ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокМонтажаВНеделях), НЕДЕЛЯ, ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокПроизводстваВНеделях)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(вт.ДатаПринятиеПомещения, НЕДЕЛЯ, ПриложенияКДоговорамИзделияЗаказчика.Ссылка.ВнутреннийЗапасВНеделях), НЕДЕЛЯ, ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокМонтажаВНеделях), НЕДЕЛЯ, ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокПроизводстваВНеделях)
		|	КОНЕЦ,
		|	ДатыКомплектаМонтаж.КрайМонтажа
		|
		|УПОРЯДОЧИТЬ ПО
		|	вт.ПроизводственныйКомплект.Наименование";
	
	Запрос.УстановитьПараметр("ИзделиеКомплект", Комплекты);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ЗаполнитьПроизводственныеКомплекты(Комплекты)

Функция ЗаполнитьКомплектыИзделий(мСделки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплектИзделияЭлемент.Ссылка КАК Ссылка,
		|	ИзделияКомплектИзделияЭлемент.Ссылка.ДатаВнешнегоСоглосования КАК ДатаВнешнегоСоглосования,
		|	МАКСИМУМ(ЕСТЬNULL(ПлановаяГотовностьПомещений.ДатаГотовности, ДАТАВРЕМЯ(1, 1, 1))) КАК ДатаПринятия,
		|	МАКСИМУМ(ПриложенияКДоговорамИзделияЗаказчика.Ссылка.ДатаДоговора) КАК ДатаДоговора,
		|	МАКСИМУМ(ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокПроизводстваВНеделях) + МАКСИМУМ(ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокМонтажаВНеделях) + МАКСИМУМ(ПриложенияКДоговорамИзделияЗаказчика.Ссылка.ВнутреннийЗапасВНеделях) КАК СрокСдвигаВНеделях
		|ПОМЕСТИТЬ втМинДатаДоговора
		|ИЗ
		|	Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПриложенияКДоговорам.ИзделияЗаказчика КАК ПриложенияКДоговорамИзделияЗаказчика
		|			ПО ИзделияЗаказчикаИзделияЭлемент.Ссылка = ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика
		|		ПО ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент = ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановаяГотовностьПомещений.СрезПоследних КАК ПлановаяГотовностьПомещений
		|		ПО ИзделияКомплектИзделияЭлемент.Ссылка.ОсновноеПомещение = ПлановаяГотовностьПомещений.Помещение
		|ГДЕ
		|	ИзделияКомплектИзделияЭлемент.Ссылка.Проект В(&мСделки)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзделияКомплектИзделияЭлемент.Ссылка.ДатаВнешнегоСоглосования,
		|	ИзделияКомплектИзделияЭлемент.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втМинДатаДоговора.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА втМинДатаДоговора.ДатаВнешнегоСоглосования > ВЫБОР
		|				КОГДА втМинДатаДоговора.ДатаПринятия = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА &ТекущаяДата
		|				ИНАЧЕ втМинДатаДоговора.ДатаПринятия
		|			КОНЕЦ
		|			ТОГДА ДОБАВИТЬКДАТЕ(втМинДатаДоговора.ДатаВнешнегоСоглосования, НЕДЕЛЯ, втМинДатаДоговора.СрокСдвигаВНеделях)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВЫБОР
		|					КОГДА втМинДатаДоговора.ДатаПринятия = ДАТАВРЕМЯ(1, 1, 1)
		|						ТОГДА &ТекущаяДата
		|					ИНАЧЕ втМинДатаДоговора.ДатаПринятия
		|				КОНЕЦ, НЕДЕЛЯ, втМинДатаДоговора.СрокСдвигаВНеделях)
		|	КОНЕЦ КАК ДатаДоговора,
		|	ДОБАВИТЬКДАТЕ(втМинДатаДоговора.ДатаДоговора, НЕДЕЛЯ, втМинДатаДоговора.СрокСдвигаВНеделях) КАК ПсиДата,
		|	втМинДатаДоговора.ДатаПринятия КАК ДатаПринятия
		|ПОМЕСТИТЬ втДатаДоговора
		|ИЗ
		|	втМинДатаДоговора КАК втМинДатаДоговора
		|
		|СГРУППИРОВАТЬ ПО
		|	ДОБАВИТЬКДАТЕ(втМинДатаДоговора.ДатаДоговора, НЕДЕЛЯ, втМинДатаДоговора.СрокСдвигаВНеделях),
		|	втМинДатаДоговора.Ссылка,
		|	ВЫБОР
		|		КОГДА втМинДатаДоговора.ДатаВнешнегоСоглосования > ВЫБОР
		|				КОГДА втМинДатаДоговора.ДатаПринятия = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА &ТекущаяДата
		|				ИНАЧЕ втМинДатаДоговора.ДатаПринятия
		|			КОНЕЦ
		|			ТОГДА ДОБАВИТЬКДАТЕ(втМинДатаДоговора.ДатаВнешнегоСоглосования, НЕДЕЛЯ, втМинДатаДоговора.СрокСдвигаВНеделях)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВЫБОР
		|					КОГДА втМинДатаДоговора.ДатаПринятия = ДАТАВРЕМЯ(1, 1, 1)
		|						ТОГДА &ТекущаяДата
		|					ИНАЧЕ втМинДатаДоговора.ДатаПринятия
		|				КОНЕЦ, НЕДЕЛЯ, втМинДатаДоговора.СрокСдвигаВНеделях)
		|	КОНЕЦ,
		|	втМинДатаДоговора.ДатаПринятия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК ИзделиеКомплект,
		|	ИзделияКомплект.ПланПКД КАК ПланПКД,
		|	ИзделияКомплект.ПланРКД КАК ПланРКД,
		|	ИзделияКомплект.ОсновноеПомещение.Ссылка КАК Помещение,
		|	ИзделияКомплект.Наименование КАК Наименование,
		|	ЕСТЬNULL(ДатыКомплекта.КрайПКД, ДАТАВРЕМЯ(1, 1, 1)) КАК КрайПКД,
		|	ЕСТЬNULL(ДатыКомплекта.КрайРКД, ДАТАВРЕМЯ(1, 1, 1)) КАК КрайРКД,
		|	ЕСТЬNULL(ДатыКомплекта.КрайТЗ, ДАТАВРЕМЯ(1, 1, 1)) КАК КрайТЗ,
		|	ИзделияКомплект.Конструктор КАК Конструктор,
		|	ИзделияКомплект.ДатаВнешнегоСоглосования КАК ДатаВнешнегоСоглосования,
		|	ИзделияКомплект.НаСогласование КАК НаСогласование,
		|	ИзделияКомплект.НаУтверждение КАК НаУтверждение,
		|	ИзделияКомплект.ПланМонтажа КАК ПланМонтажа,
		|	ИзделияКомплект.ПланПроизводства КАК ПланПроизводства,
		|	втДатаДоговора.ДатаДоговора КАК ДогДата,
		|	ЕСТЬNULL(ДатыКомплектаПроизводство.КрайПроизводства, ДАТАВРЕМЯ(1, 1, 1)) КАК КрайПроизводства,
		|	ЕСТЬNULL(ДатыКомплектаМонтаж.КрайМонтажа, ДАТАВРЕМЯ(1, 1, 1)) КАК КрайМонтажа,
		|	втДатаДоговора.ПсиДата КАК ПсиДата,
		|	втДатаДоговора.ДатаПринятия КАК ДатаПринятия
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|		ПО (ДатыКомплекта.Комплект = ИзделияКомплект.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ втДатаДоговора КАК втДатаДоговора
		|		ПО (втДатаДоговора.Ссылка = ИзделияКомплект.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплектаПроизводство КАК ДатыКомплектаПроизводство
		|		ПО ИзделияКомплект.Ссылка = ДатыКомплектаПроизводство.Комплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплектаМонтаж КАК ДатыКомплектаМонтаж
		|		ПО ИзделияКомплект.Ссылка = ДатыКомплектаМонтаж.Комплект
		|ГДЕ
		|	ИзделияКомплект.Проект В(&мСделки)
		|	И НЕ ИзделияКомплект.ЭтоГруппа
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзделияКомплект.Ссылка,
		|	ИзделияКомплект.ПланПКД,
		|	ИзделияКомплект.ПланРКД,
		|	ИзделияКомплект.ОсновноеПомещение.Ссылка,
		|	ИзделияКомплект.Наименование,
		|	ИзделияКомплект.Конструктор,
		|	ИзделияКомплект.ДатаВнешнегоСоглосования,
		|	ИзделияКомплект.НаСогласование,
		|	ИзделияКомплект.НаУтверждение,
		|	ИзделияКомплект.ПланМонтажа,
		|	ИзделияКомплект.ПланПроизводства,
		|	втДатаДоговора.ДатаДоговора,
		|	втДатаДоговора.ПсиДата,
		|	ЕСТЬNULL(ДатыКомплекта.КрайПКД, ДАТАВРЕМЯ(1, 1, 1)),
		|	ЕСТЬNULL(ДатыКомплекта.КрайРКД, ДАТАВРЕМЯ(1, 1, 1)),
		|	ЕСТЬNULL(ДатыКомплекта.КрайТЗ, ДАТАВРЕМЯ(1, 1, 1)),
		|	ЕСТЬNULL(ДатыКомплектаПроизводство.КрайПроизводства, ДАТАВРЕМЯ(1, 1, 1)),
		|	ЕСТЬNULL(ДатыКомплектаМонтаж.КрайМонтажа, ДАТАВРЕМЯ(1, 1, 1)),
		|	втДатаДоговора.ДатаПринятия
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
	Запрос.УстановитьПараметр("мСделки", мСделки);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ЗаполнитьКомплектыИзделий(мСделки)

&НаКлиенте
Процедура СделкаПриИзменении(Элемент)
	СформироватьОтчетНаСервере();
КонецПроцедуры 

Функция ПолучитьСделки()

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.Ссылка КАК Проект
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ТОГДА НЕ Проекты.НеВыводитьНаДиаграмму
		|			ИНАЧЕ Проекты.Ссылка = &Проект
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Проект", Сделка);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Проект");
	
	
КонецФункции // ПолучитьСделки()
